[{"name":"Christian McCaffrey","note":"Coming off injury still could be the best out there a"},{"name":"Julio Jones","note":"new team, probably too pricey / risky "},{"name":"Dalvin Cook","note":"Minn's workhorse lots of touches go YPC "},{"name":"Derrick Henry","note":"Arguable the #1 pick "},{"name":"Alvin Kamara","note":"Stub but no more Drew Breez means he is no longer a slam dunk"},{"name":"Ezekiel Elliott","note":"Might be undervalued due to recency bias "},{"name":"Clyde Edwards-Helaire","note":"2nd Year, less backfield competition, upgraded o-line"},{"name":"Saquon Barkley","note":"AVOID, might start season limited. Still a 3 down back tho"},{"name":"Jonathan Taylor","note":"2nd year, great ypc, will have backfield competition. Now has Wentz instead of Rivers"},{"name":"Aaron Jones","note":"over 5 YPC 3 years out of 4 might have bf competition but should have passing increases"},{"name":"Joe Mixon","note":"Target Only 25, no more Gio bernard! weird injury situation last year, should see more receptions "},{"name":"Najee Harris","note":"ROOKIE, 3 down back in Pittsburd, target, but rookies tend to be expensive"},{"name":"JK Dobbins","note":"TORN ACL (Late round flyer keeper stash)"},{"name":"Chris Carson","note":"AVOID. Time share with Rashaad Penny who is now fully healthy, Sea almost let Carson walk"},{"name":"Darrell Henderson","note":"Now competing with Sony Michelle, showed flashes of a difference maker last year but no consistent touches "},{"name":"David Montgomery","note":"Took awhile to get going last season, Ty Cohen is back and rookie QB.  Could go either way"},{"name":"Miles Sanders","note":"Competing with Gainwell for pass catching, Sanders has never exceled "},{"name":"D'Andre Swift","note":"Time share with Jamaal Williams.  Never really got a chance to get going last year could be really high upside "},{"name":"Josh Jacobs","note":"Low YPC, High Tds, will has a DUI suspension, competing with Kenyan Drake"},{"name":"James Robinson","note":"Will be competing for touches with 1st round Rookie Travis Etienne"},{"name":"Mike Davis","note":"Target.  Took over to McCaffery last year. Somehow the starter in ATL, UPSIDE "},{"name":"Chase Edmonds","note":"ARI signed James Conner but Edmonds should get a feature role "},{"name":"Javonte Williams","note":"Target Loads of talent, good numbers despite time share, only has to out-compete Melvin Gordon to breakout"},{"name":"Kareem Hunt","note":"Was underwhelming even when Chubb was hurt for 4 weeks last year "},{"name":"Raheem Mostert","note":"49ers #1 back in name only, lots of competition"},{"name":"Trey Sermon","note":"Starting on PUP, good stash if cheap and overtakes Mostert"},{"name":"Ronald Jones","note":"Could have an impact but has Fornette as a 1A and Gio Bernard as a pass catching competitor "},{"name":"Michael Carter","note":"Target, will have a chance to be Jets bellcow "},{"name":"James Conner","note":"Relegated to backup duties on a 1 year deal"},{"name":"Leonard Fournette","note":"Flyer, time share and has never lived up to his potential"},{"name":"AJ Dillon","note":"UPSIDE, FLYER, Aaron jones handcuff, playing 2nd team in pre-season, could be very productive if given touches"},{"name":"Melvin Gordon","note":"Flyer, low value is based on Rookie williams assumed role.  Still 28 and best years behind him"},{"name":"Gus Edwards","note":"TARGET!, JK Dobbins out makes him the guy in BAL.  Will have passing game competition thought."},{"name":"Zack Moss","note":"Seems like same competition as last year with Singletary. "},{"name":"Tony Pollard","note":"Pure handcuff even if Zeke struggles "},{"name":"Nyheim Hines","note":"Might not even get started duties with a Jonathan Taylor injury"},{"name":"Giovani Bernard","note":"New Team, passing specialist in Tampa behind to so-so guys"},{"name":"Devin Singletary","note":"Splitting carries with Zack Moss again, and wasn't very effective when he did get touches "},{"name":"Jamaal Williams","note":"Never been a lead back and will split carries in Detroit "},{"name":"Latavius Murray","note":"HANDCUFF. Alvin Kamara "},{"name":"Kenyan Drake","note":"Didn't exceed last year as an every down back and is now behind Josh Jacobs "},{"name":"JD McKissic","note":"FLYER, UPSIDE. 2nd most RB receptions last year, buried in WAS depth chart this year but who knows "},{"name":"Alexander Mattison","note":"FLYER Dalvin Cook handcuff, could have a huge workload if Cook gets hurt "},{"name":"Rashaad Penny","note":"VALUE, FLYER Returning from ACL tear.  Could still out play Chris Carson and have a big role"},{"name":"Damien Williams","note":"Backup for Montgomery but will also have Tarik Cohin in backfield if he gets starters job"},{"name":"Phillip Lindsay","note":"3 man time share with Johnson and Marg Ingram.  Probably the best of the 3 though"},{"name":"Tevin Coleman","note":"FLYER Best of the worst of Jets backfield"},{"name":"David Johnson","note":"TARGET Could be a good 4th Flex as a low floor guy"},{"name":"Rhamondre Stevenson","note":"TARGET, Sleeper. Good Pre-season and you never know who will emerge from the Pats backfield"},{"name":"Austin Ekeler","note":"TARGET Could have had a monster year if he was healthy "},{"name":"Nick Chubb","note":"Really great year and lots of talent but very high pick for a potential timeshare "},{"name":"Antonio Gibson","note":"2nd year, has a chance to be bell cow in WAS"},{"name":"Myles Gaskin","note":"Mia default starting RB.  Could be a low floor deep Flex guy, decent chance of being replaced at some point in the deason"},{"name":"Damien Harris","note":"Should lead Pats in carries but who knows with the Pats"},{"name":"DeAndre Hopkins","note":"TARGET, only elite non-kept WR, 30% target share last year, has a rookie to compete with for targets but that could also help"},{"name":"Allen Robinson","note":"TARGET Andy Dalton new QB could effect air yards (good or bad) quietly the WR9 last year"},{"name":"Terry McLaurin","note":"WAS #1 targets, Ryan Fitzpatrick at QB is somehow an upgrade "},{"name":"Amari Cooper","note":"VALUE, Fresh PUP list, was 2nd hightest WR before Dak went down, draft for right price "},{"name":"Mike Evans","note":"Still as good as last year but very TD dependent, should see a drop in targets to a healthy Goodwin "},{"name":"DJ Moore","note":"VALUE Sam Darnold an upgrade over Teddy Bridgewater.  Was boom or bust last year after a good 2019, mabye a regression to the mean creates improvement.  However robby anderson might be similar and cheaper"},{"name":"Chris Godwin","note":"Should improve just by being healthy, WR 2 for Brady is not bad, but sharing with Mike Evans "},{"name":"Robert Woods","note":"Goff Out, Stafford In should help, still the 1 to Kupps 1a though"},{"name":"Adam Thielen","note":"Was a risky pick last year bailed out by TDs, will remain risky this year with a change of TD regression "},{"name":"Tyler Lockett","note":"VALUE, hight AY compared to ADP, #2 to DK Metcaff on depth chart and fizzled down the stretch last year, might have been nursing an injury last year "},{"name":"Cooper Kupp","note":"VALUE, similar to woods but a little cheaper, should see some more TDs based on regression.  Stafford should help"},{"name":"Ja'Marr Chase","note":"Rookie, Should be CIN WR1, the price has to be right though "},{"name":"Diontae Johnson","note":"TARGET, VALUE,  3rd Year, league's 8th most targets, low floor compared to other guys in this area / price range.  Claypool might be a cheaper similar option however "},{"name":"Tee Higgins","note":"2nd Year, WR2 opposite a rookie, boom or bust guy last year.  Either steps up this year or is irrelevant by next year "},{"name":"Odell Beckham","note":"VALUE, somehow only 29, Mayfield might no how to play QB after all, still very talented "},{"name":"Brandon Aiyuk","note":"New Rookie QB, could get better could get worse "},{"name":"Chase Claypool","note":"TARGET VALUE 2nd Year, should be WR 1, was TD dependent but could be a steal, competing with Dionte, JuJu, "},{"name":"Robby Anderson","note":"VALUE Turned into a possession guy last season which inflated his targets, however an upgrade at QB could help.  Positive TD regression likely "},{"name":"Will Fuller","note":"FLYER, VALUE Finally turned the corner, got popped for PEDs, now sent from HOU to MIA, so new offense and QB. Could go either way"},{"name":"DJ Chark","note":"TARGET, VALUE Urban Meyer told him to get bigger and he did, only really competition is Marvin Jones, coming off injury so might start slow"},{"name":"JuJu Smith-Schuster","note":"Turned into a possesion receiver last year, is asking and not getting my outside routes.  Crowded receiver corps "},{"name":"Tyler Boyd","note":"Slot receiver with a new Rookie WR to contend for targets with"},{"name":"Deebo Samuel","note":"VALUE Injured last year.  Rookie QB could create uptick due to lack of other changes in offense "},{"name":"Laviska Shenault","note":"2nd Year, underneath slot guy who now was some competition in the slot.  "},{"name":"Jerry Jeudy","note":"VALUE 2nd year, had a bad Rookie year but was be the most targeted DEN WR due to Sutton's ACL.  Sutton is back."},{"name":"Michael Thomas","note":"INJURED, Value, Stash Won't return until week 8 at the earliest"},{"name":"Kenny Golladay","note":"TARGET, VALUE Hurt most of last year, should be NYG #1 option take him if he falls"},{"name":"Brandin Cooks","note":"Should be HOU WR1 but QB will by Tyrod Taylor. No longer competing with Will Fuller "},{"name":"Jarvis Landry","note":"Will be competing with Odell Beckham for targets in a run heavy offense.  Has never been the guy"},{"name":"Mecole Hardman","note":"3rd year.  Will be competing with Byron Pringle in the slot. This would be a bet on his pure talent finally showing up  "},{"name":"Curtis Samuel","note":"TARGET, VALUE, New team, probably won't get rushing opportunities but is a playmaker. Upgrades from Bridgewater to Fitzpatrick"},{"name":"DeVonta Smith","note":"ROOKIE, sprained MCL in august, hard to gauge  "},{"name":"Michael Gallup","note":"Same roll as last year except Dak is back and Cee Dee will probably get more looks.  Still a homerun threat"},{"name":"Antonio Brown","note":"FLYER, Might have legal trouble, worth a flyer"},{"name":"DeVante Parker","note":"Now competing with Fuller and never reliable "},{"name":"Marquise Brown","note":"TARGET, VALUE Great 2nd half of the year.  now competing with Sammy Watkins and a Rookie.  Could still be Jackson WR1 "},{"name":"Mike Williams","note":"TARGET, UPSIDE, could be a major playmaker for Chargers due to new offense "},{"name":"Corey Davis","note":"VALUE, UPSIDE NYJ #1 wide out with a rookie qb. Upside "},{"name":"Darnell Mooney","note":"Was okay last year and deep ball threat. Could improve with Andy Dalton"},{"name":"Cole Beasley","note":"VALUE, will get catches and do his thing in the slot could be a good bye week filler "},{"name":"Jaylen Waddle","note":"ROOKIE, competition with Fuller and Parker, could end up as a slot threat"},{"name":"Elijah Moore","note":"ROOKIE, competing with Crowder in the slot and is a JET "},{"name":"Michael Pittman","note":"2nd year, would be a total guess, not looking good with Wentz at QB and T.Y. Hilton competing for targets "},{"name":"Rondale Moore","note":"ROOKIE, behing Hopkins and AJ Green "},{"name":"Russell Gage","note":"Could grab some of Julio Jones target share but not the best option"},{"name":"Marvin Jones","note":"VALUE Might carve out a in Jacsonville where he will play on the same offense as DET. Still old "},{"name":"Henry Ruggs","note":"2nd Year, 12th overall last year.  Got very few targets last year, might be worth a bet on that changing with Agholor gone "},{"name":"TY Hilton","note":"31 years old, almost retired, Carson Wentz is QB, still WR1 in INDY"},{"name":"Gabriel Davis","note":"FLYER 2nd Year, came off the bench last year and was productive.  John Brown leaving should give him more snaps.  "},{"name":"Jalen Reagor","note":"2nd YEAR, Hurts QB instead of Wentz, only was on the field 66% of snaps last year "},{"name":"Jamison Crowder","note":"FLYER, Could get cut by the Jets where he might split time in the slot, but could be a cap casualty which could make him the slot starter on a better team"},{"name":"Sterling Shepard","note":"Same old shit"},{"name":"Emmanuel Sanders","note":"FLYER 34 years old, might be wroth a buck "},{"name":"Nelson Agholor","note":"FLYER Would have to fit in New England but could be a long ball specialist "},{"name":"Randall Cobb","note":"HANDCUFF, back with Packers "},{"name":"Jakobi Meyers","note":"STASH, could be worth seeing how things shake out in NE"},{"name":"Terrace Marshall","note":"Has had a nice pre-season and could be CAR WR3"},{"name":"Rashod Bateman","note":"ROOKIE, FLYER unclear if he will get enough snaps to make a difference, "},{"name":"Parris Campbell","note":"VALUE, FLYER 3rd Year, injured last year, switches from Philip Rivers to Carson Wentz, inturesting value this late though"}]