[{"name":"Davante Adams","note":"Still elite but no more Aaron Rodgers probably not worth it for the price"},{"name":"Deebo Samuel","note":"Elite product but might have to deal with Tray Lance as QB not worth the premium"},{"name":"DJ Moore","note":"Target Very high air yards last year and probably gets an upgrade at qb in Baker Mayfield "},{"name":"Jerry Jeudy","note":"Gets an upgrade at QB in Russel Wilson "},{"name":"Mike Evans","note":"Chris Godwin going down with a torn-ACL and Antonio Brown going crazy probably inflated Evans last year. TD regression cnadidate "},{"name":"Courtland Sutton","note":"Great first 6 weeks followed by being borderline unstartable in the last 11 games of last season.  Russel Wilson upgrade a qb"},{"name":"Keenan Allen","note":"30 years old this season, should still be Chargers' #1.  He should keep that roll but hasn't benefited as much as you'd expect from Herbet "},{"name":"Diontae Johnson","note":"Was the 11th best fantasy WR with Big Ben throwing him the ball (poorly) but now will either have Trubisky or rookie Kenny Picktett under center "},{"name":"AJ Brown","note":"Last year's potential 3rd year WR bounce got derailed by injury.  Now he is on the Eagles and trades Ryan Tannehill for Jalen Hurts.  Too many unknowns "},{"name":"Tee Higgins","note":"Low end WR 2 but can't have two receivers on the same team"},{"name":"Mike Williams","note":"Mabye Target. Lead charges in air yards despite being number 2 to Keenan Allen on LAC.  Was inconsistent in the middle of last season "},{"name":"Terry McLaurin","note":"Target for right Price. Very high air yards for someone with a nobody QB.  Now has Carson Wentz which is still somehow an upgrade.  Will have more competition for targets  "},{"name":"Chris Godwin","note":"High Risk / Reward.  Coming off badly torn ACL, on the practice field during the preseason but is a huge risk. "},{"name":"Tyler Lockett","note":"Great 2021 but now has Drew Lock as his QB "},{"name":"Travis Kelce","note":"Target for the right price "},{"name":"Mark Andrews","note":"Very good and might cost less then Kelce "},{"name":"Kyle Pitts","note":"Had a very good rookie season, loses Matt Ryan as QB "},{"name":"Aaron Jones","note":"Avoid - Competing with AJ Dillion (who everyone seems to like this year) "},{"name":"Clyde Edwards-Helaire","note":"Avoid - 3rd year, terrible YPC and he could be done as a RB1 if he doesn't succeed this year"},{"name":"Leonard Fournette","note":"Target - should have value due to being on a good team, having volume, 31st in the league in blocking independent running though.  Should be the goalline back as well but 10 tds aren't guaranteed again "},{"name":"Marquise Brown","note":"Flyer - Became very unreliable down the stretch last year.  Got traded to the Cardinals which are more pass friendly. DeAndre Hopkins is suspended for first 6 games.  "},{"name":"Amari Cooper","note":"Avoid - Will not have Deshuan Watson for 11 weeks.  Best years are behind him unless getting out of Dallas gives him a bumb like getting out of Oakland did. "},{"name":"Jalen Tolbert","note":"ROOKIE - FLYER "},{"name":"D'Andre Swift","note":"3rd Year. Target at right price (risky).  Touches went up from 114 to 151 but YPC down 4.6 to 4.1.  Was also injured 4 games.  Only had more than 14 carries once and competing with touches with Jamaal WIlliams who sucks.  Goeff still his QB.  Has talent to over come this but risky"},{"name":"Ezekiel Elliott","note":"Played through ha PCL injury.  Competing for snaps with the more effective Tony Pollard.  Was on fire at the beginning of last season (probably pre-injury).  Should have value based on workload alone but is not the bell-cow he once was"},{"name":"David Montgomery","note":"Target - Competiting for touches with 2nd year Khalil Herbert.   Expected to be valuable for volume alone.  Bad team.  New coach with new offensive scheme (could be good or bad) "},{"name":"Rashaad Penny","note":"Target, Flyer - Competition with rookie for touches, team is downgraded at QB.  Had a ridiculous fantasy playoff run last year, only got a 1 year contract out of it.  Would have kept him if I had another keeper spot "},{"name":"DK Metcalf","note":"Drew Lock is now his QB.  Total gamble with very high upside "},{"name":"Javonte Williams","note":"Target for right price - Had a great rookie season despite competition for touches with Melvin Gordon (re-signed).  Upgrade at QB.  Could breakout if Gordon gets out of his way. "}]